Revit 2027 API
StructuralAsset.SubClass Property
 The sub-class of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SubClass { get; set; }
Public Property SubClass As String
	Get
	Set
public:
property String^ SubClass {
	String^ get ();
	void set (String^ value);
}
member SubClass : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace